# GetSymRot

## Description
Function GetSymRot returns the rotation angle (in degrees) of the referenced symbol or plug-in object.

```pascal
FUNCTION GetSymRot(symHd : HANDLE): REAL;
```

```python
def vs.GetSymRot(symHd):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|symHd|HANDLE|Handle to symbol.|

## Version
Availability: from All Versions

## Category
* Object Info